#include <locale.h>
#include <stdio.h>
#include "name.h"
void main()
{
	name();
	setlocale(LC_ALL, "RUS");
	puts("Моя программа");
	puts("*********************************************************************************************************************************************************");
	puts("Hello Word!");
	puts("                                      Пример разработки консольного приложения - вывода текста");
	puts("БИСТ-222,Любачев Владислав");
	puts("*********************************************************************************************************************************************************");
	puts("__ ___  __ ___  __");
	puts(" | |_  |  | _/ |  | |__|");
	puts("/_ |_|.|__| / .|__|    |");
	getchar();
}